---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveArrArray.Size
source: html/5848c48a-7904-860c-9d72-22c69f3ae706.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```